package elements;

import org.openqa.selenium.By;
import static com.codeborne.selenide.Selenide.$;

public class ButtonDialogWindow {
    //*****************************************************************************************************************************************************************************
    //Локаторы элемента; переменные, используемые в методах элемента
    //*****************************************************************************************************************************************************************************
    String buttonLocator = "//div[@class='ant-modal-content']//span[text()='%s']/ancestor::button"; // локатор кнопок 'OK', 'Отмена' диалогового окна
    String buttonName; //название кнопки

    //*****************************************************************************************************************************************************************************
    //Методы элемента
    //*****************************************************************************************************************************************************************************
    //Конструктор для подстановки переменных в методы элемента
    public ButtonDialogWindow(String buttonName) {
        this.buttonName = buttonName;
    }

    //Метод нажатия на кнопку
    public void click() {
        $(By.xpath(String.format(buttonLocator, this.buttonName))).click();
    }
}
