package elements;

import com.codeborne.selenide.SelenideElement;
import org.openqa.selenium.By;
import static com.codeborne.selenide.Selenide.$;

public class Button {

    //*****************************************************************************************************************************************************************************
    //Локаторы элемента; переменные, используемые в методах элемента
    //*****************************************************************************************************************************************************************************
    String buttonLocator = "//span[text()='%s']/ancestor::button"; //локатор кнопок. В локаторе связано название кнопки и сама кнопка, так как на странице может быть несколько кнопок с одинаковыми локаторами и отличающиеся только названиями
    String buttonName; //название кнопки

    //*****************************************************************************************************************************************************************************
    //Методы элемента
    //*****************************************************************************************************************************************************************************
    //Конструктор для подстановки переменных в методы элемента
    public Button(String buttonName) {
        this.buttonName = buttonName;
    }

    //Метод, возвращающий элемент - кнопку
    public SelenideElement Button() {
        return $(By.xpath(String.format(buttonLocator, this.buttonName)));
    }

    //Метод нажатия на кнопку
    public void click() {
        $(By.xpath(String.format(buttonLocator, this.buttonName))).click();
    }
}
