package elements;

import org.openqa.selenium.By;
import static com.codeborne.selenide.Selenide.$;

public class DropDownDialogWindow {

    //*****************************************************************************************************************************************************************************
    //Локаторы элемента; переменные, используемые в методах элемента
    //*****************************************************************************************************************************************************************************
    String dropdownLocator = "//div[@class='ant-modal-content']//label[contains(@title,'%s')]/ancestor::div[contains(@class, 'ant-row ant-form-item')]//input[contains(@class, 'ant-input')]"; //раскрывающийся список "Наименование родителя": поле ввода
    String dropdownOptionsLocator = "//div[@class='ant-modal-content']//li[contains(@title,'%s')]"; //раскрывающийся список "Наименование родителя": собственно список значений
    String label; //название раскрывающегося списка - "Наименование родителя"

    //*****************************************************************************************************************************************************************************
    //Методы элемента
    //*****************************************************************************************************************************************************************************
    //Конструктор для подстановки переменных в методы элемента
    public DropDownDialogWindow(String label) {
        this.label = label;
    }

    //Метод выбора значения из раскрывающегося списка
    public void selectOption(String option) {
        $(By.xpath(String.format(dropdownLocator, this.label))).click(); //раскрыть список кликом
        $(By.xpath(String.format(dropdownOptionsLocator, option))).click(); //выбрать кликом нужное значение списка
    }
}
