package elements;

import com.codeborne.selenide.SelenideElement;
import org.openqa.selenium.By;

import static com.codeborne.selenide.Selenide.$;

public class InputErrorMessage {

    //*****************************************************************************************************************************************************************************
    //Локаторы элемента; переменные, используемые в методах элемента
    //*****************************************************************************************************************************************************************************
    String inputErrorMessageLocator = "//label[contains(@title,'%s')]/ancestor::div[contains(@class, 'ant-row ant-form-item')]//div[@class='ant-form-explain']"; //если не заполнен Input под ним сообщение появляется
    String label;//название поля ввода

    //*****************************************************************************************************************************************************************************
    //Методы элемента
    //*****************************************************************************************************************************************************************************
    //Конструктор для подстановки переменных в методы элемента
    public InputErrorMessage(String label) {
        this.label = label;
    }

    //Метод, возвращающий веб-элемент - сообщение об ошибке при незаполненном поле ввода (если оно обязательно для заполнения)
    public SelenideElement message() {
        return $(By.xpath(String.format(inputErrorMessageLocator, this.label)));
    }
}
